rf/admin/Request.xml

<?xml version="1.0" encoding="utf-8"?><?xml version="1.0" encoding="utf-8"?>
    <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
        <s:Header>
            <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:8080/kestrel/AirService</Action>
        </s:Header>
        <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <air:LowFareSearchAsynchReq SolutionResult="true" PreferCompleteItinerary="true" AuthorizedBy="user" TargetBranch="P1496502" xmlns:air="http://www.travelport.com/schema/air_v33_0">
                <com:BillingPointOfSaleInfo OriginApplication="UAPI" xmlns:com="http://www.travelport.com/schema/common_v33_0" />
                    <air:SearchAirLeg>
                        <air:SearchOrigin>
                            <com:CityOrAirport Code="AMS" xmlns:com="http://www.travelport.com/schema/common_v33_0" />
                        </air:SearchOrigin>
                        <air:SearchDestination>
                            <com:CityOrAirport Code="BOM" xmlns:com="http://www.travelport.com/schema/common_v33_0" />
                        </air:SearchDestination>
                       <air:SearchDepTime PreferredTime="2016-04-20" />
                       
                    </air:SearchAirLeg>
                    <air:SearchAirLeg>
                        <air:SearchOrigin>
                            <com:CityOrAirport Code="BOM" xmlns:com="http://www.travelport.com/schema/common_v33_0" />
                        </air:SearchOrigin>
                        <air:SearchDestination>
                            <com:CityOrAirport Code="AMS" xmlns:com="http://www.travelport.com/schema/common_v33_0" />
                        </air:SearchDestination>
                         <air:SearchDepTime PreferredTime="2016-04-30" />
                        
                    </air:SearchAirLeg>
                    
                    <air:AirSearchModifiers >
                    <air:PreferredProviders>
                    <com:Provider Code="ACH" xmlns:com="http://www.travelport.com/schema/common_v33_0" />
                    <com:Provider Code="1G" xmlns:com="http://www.travelport.com/schema/common_v33_0" />
                    </air:PreferredProviders>
                    
                   <!--<air:PreferredCarriers>
                     <com:Carrier xmlns:com="http://www.travelport.com/schema/common_v33_0" Code="U2" />
                     <com:Carrier xmlns:com="http://www.travelport.com/schema/common_v33_0" Code="TR" />
                   </air:PreferredCarriers>-->
                    <air:FlightType DoubleInterlineCon="false"  DoubleOnlineCon="false"  SingleInterlineCon="false" SingleOnlineCon="false" NonStopDirects="false" StopDirects="false" TripleInterlineCon="false" TripleOnlineCon="false"></air:FlightType>
                     </air:AirSearchModifiers>
                    <com:SearchPassenger Code="ADT" xmlns:com="http://www.travelport.com/schema/common_v33_0" />
                    
                    
                    <air:AirPricingModifiers FaresIndicator="PublicAndPrivateFares" CurrencyType="EUR"></air:AirPricingModifiers>
                     <air:AirSearchAsynchModifiers  >
<air:InitialAsynchResult   MaxWait="02"/>
</air:AirSearchAsynchModifiers>
            </air:LowFareSearchAsynchReq>
           
        </s:Body>
    </s:Envelope>